core/src/test/resources/Soap/Encryption/SZeebraSoap-encrypted.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
	<env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsse:Security env:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="id-here" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">IGNORE-BST</wsse:BinarySecurityToken>
			<xenc:EncryptedKey Id="id-here" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p">
					<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
				</xenc:EncryptionMethod>
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">IGNORE-KI</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>IGNORE-CIPHER-VALUE</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="uri-here"/>
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
			<wsu:Timestamp wsu:Id="id-here">
				<wsu:Created>IGNORE-CREATED</wsu:Created>
				<wsu:Expires>IGNORE-EXPIRES</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
		<wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
		<wsa:Action>http://www.company.org/bla/blaba/lala/Baa</wsa:Action>
		<wsa:MessageID>urn:uuid:fc69c06d-9e5c-abcd-1234-9a7a877450c7</wsa:MessageID>
		<myHeader xmlns="http://www.test.nl/v0101">
			<value>waarde</value>
		</myHeader>
	</env:Header>
	<env:Body>
		<xenc:EncryptedData Id="id-here" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
			<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/>
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd">
					<wsse:Reference URI="uri-here"/>
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>IGNORE-CIPHER-VALUE</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</env:Body>
</env:Envelope>